waveshareteam/ESP32-S3-Touch-AMOLED-1.75/firmware/brookesia/components/esp_xiaozhi_safe/esp_xiaozhi/src/esp_xiaozhi_chat.c
/*
 * SPDX-FileCopyrightText: 2026 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/param.h>
#include <ctype.h>

#include <esp_check.h>
#include <esp_log.h>
#include <cJSON.h>
#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>
#include <freertos/task.h>
#include <freertos/idf_additions.h>
#include <esp_idf_version.h>
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
#include <psa/crypto.h>
#else
#include <mbedtls/aes.h>
#endif
#include <freertos/event_groups.h>
#include <freertos/semphr.h>
#include <stdint.h>
#include <stdbool.h>
#include <sys/socket.h>
#include <sys/time.h>
#include <netdb.h>
#include <errno.h>
#include <esp_event.h>
#include <esp_heap_caps.h>

#include "esp_mcp_engine.h"
#include "esp_mcp_mgr.h"

#include "esp_xiaozhi_mcp.h"
#include "esp_xiaozhi_transport.h"
#include "esp_xiaozhi_chat.h"

#define ESP_XIAOZHI_CHAT_MAX_STRING_SIZE 256
#define ESP_XIAOZHI_CHAT_AES_NONCE_SIZE 16
#define ESP_XIAOZHI_CHAT_AES_KEY_SIZE 16

#define ESP_XIAOZHI_CHAT_CLOSE_MUTEX_RETRY_MS   1000
#define ESP_XIAOZHI_CHAT_CLOSE_MUTEX_RETRY_CNT 3
#define ESP_XIAOZHI_CHAT_TASK_EXIT_WAIT_MS 2000
#define ESP_XIAOZHI_CHAT_UDP_RECV_TIMEOUT_MS 200
#define ESP_XIAOZHI_CHAT_UDP_SEND_TIMEOUT_MS 20
#define ESP_XIAOZHI_CHAT_UDP_BACKPRESSURE_DELAY_MS 10
#define ESP_XIAOZHI_CHAT_UDP_MIN_PORT 1
#define ESP_XIAOZHI_CHAT_UDP_MAX_PORT 65535

#define ESP_XIAOZHI_CHAT_TASK_NAME "chat_audio"
#define ESP_XIAOZHI_CHAT_MIN_SAMPLE_RATE 8000
#define ESP_XIAOZHI_CHAT_MAX_SAMPLE_RATE 48000
#define ESP_XIAOZHI_CHAT_MIN_CHANNELS 1
#define ESP_XIAOZHI_CHAT_MAX_CHANNELS 2
#define ESP_XIAOZHI_CHAT_MIN_FRAME_DURATION_MS 10
#define ESP_XIAOZHI_CHAT_MAX_FRAME_DURATION_MS 120

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
typedef struct {
    psa_key_id_t key_id;
    bool key_imported;
} esp_xiaozhi_chat_aes_ctr_context_t;
#else
typedef mbedtls_aes_context esp_xiaozhi_chat_aes_ctr_context_t;
#endif

/* Internal sync bits: server hello received, receive enabled, shutdown, task exited */
#define ESP_XIAOZHI_CHAT_SERVER_HELLO          (1 << 0) /*!< Server hello received */
#define ESP_XIAOZHI_CHAT_RECV_RECEIVE_ENABLED  (1 << 1) /*!< Receive enabled */
#define ESP_XIAOZHI_CHAT_RECV_SHUTDOWN         (1 << 2) /*!< Shutdown */
#define ESP_XIAOZHI_CHAT_RECV_TASK_EXITED      (1 << 3) /*!< Task exited */

/**
 * @brief  UDP context for MQTT path (audio over UDP). NULL when using WebSocket.
 *        Audio input task uses static stack/TCB memory, is created on first open,
 *        kept alive across close, and exits during deinit.
 */
typedef struct {
    SemaphoreHandle_t channel_mutex;
    EventGroupHandle_t audio_receive_events;   /*!< RECEIVE_ENABLED: may receive; SHUTDOWN: task must exit */
    int udp_socket;
    struct sockaddr_in udp_addr;
    char udp_server[ESP_XIAOZHI_CHAT_MAX_STRING_SIZE];
    int udp_port;
    esp_xiaozhi_chat_aes_ctr_context_t aes_ctx;
    uint8_t aes_nonce[ESP_XIAOZHI_CHAT_AES_NONCE_SIZE];
    uint32_t local_sequence;
    uint32_t remote_sequence;
    uint32_t last_incoming_time;
} esp_xiaozhi_chat_udp_ctx_t;

/**
 * @brief  Xiaozhi chat
 */
typedef struct {
    bool use_mqtt;                                      /*!< Use MQTT for this session (prefer MQTT when both supported) */
    bool owns_mcp_engine;                               /*!< Whether this instance owns mcp_engine */
    bool error_occurred;                                /*!< Error occurred */
    bool chat_connected;                                /*!< Chat connected */
    bool audio_channel_opened;                          /*!< Audio channel opened */
    esp_xiaozhi_chat_device_state_t device_state;       /*!< Device state */
    esp_xiaozhi_chat_listening_mode_t listening_mode;   /*!< Listening mode */
    esp_xiaozhi_transport_handle_t mcp_chat_handle;           /*!< Transport handle for MCP chat */
    EventGroupHandle_t event_group_handle;              /*!< Event group for handling events */

    esp_mcp_t *mcp_engine;                              /*!< MCP engine instance for processing MCP protocol */
    esp_mcp_mgr_handle_t mcp_mgr_handle;                /*!< MCP manager handle */

    esp_xiaozhi_chat_udp_ctx_t *udp;                    /*!< UDP context for MQTT path; NULL when WebSocket */

    char session_id[ESP_XIAOZHI_CHAT_MAX_STRING_SIZE];  /*!< Session ID */
    int server_sample_rate;                             /*!< Server sample rate */
    int server_frame_duration;                          /*!< Server frame duration */

    esp_xiaozhi_chat_audio_type_t       audio_type;     /*!< Audio type */
    esp_xiaozhi_chat_audio_callback_t   audio_callback; /*!< Callback function for handling audio data */
    esp_xiaozhi_chat_event_callback_t   event_callback; /*!< Callback function for handling events */
    void                           *audio_callback_ctx; /*!< Context pointer passed to the audio callback */
    void                           *event_callback_ctx; /*!< Context pointer passed to the event callback */
} esp_xiaozhi_chat_t;

/**
 * @brief  Type function for Xiaozhi chat
 */
typedef struct {
    const char *type;
    esp_err_t (*handler)(esp_xiaozhi_chat_t *xiaozhi_chat, cJSON *root);
} esp_xiaozhi_chat_type_func_t;

ESP_EVENT_DEFINE_BASE(ESP_XIAOZHI_CHAT_EVENTS);

static const char *TAG = "ESP_XIAOZHI_CHAT";

#define ESP_XIAOZHI_EVENT_POST_TIMEOUT pdMS_TO_TICKS(100)

static esp_xiaozhi_chat_t *s_xiaozhi_chat = NULL;
static portMUX_TYPE s_xiaozhi_chat_lock = portMUX_INITIALIZER_UNLOCKED;
#if CONFIG_XIAOZHI_AUDIO_TASK_ALLOC_STATIC
static StaticTask_t s_audio_input_task_tcb;
static StackType_t s_audio_input_task_stack[CONFIG_XIAOZHI_AUDIO_TASK_STACK_SIZE];
#endif

static void esp_xiaozhi_chat_audio_input(void *pvParameter);

static void esp_xiaozhi_chat_aes_ctr_init(esp_xiaozhi_chat_aes_ctr_context_t *ctx)
{
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
    ctx->key_id = 0;
    ctx->key_imported = false;
#else
    mbedtls_aes_init(ctx);
#endif
}

static int esp_xiaozhi_chat_aes_ctr_setkey(esp_xiaozhi_chat_aes_ctr_context_t *ctx,
                                           const uint8_t *key,
                                           size_t key_bits)
{
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
    if (ctx->key_imported) {
        psa_destroy_key(ctx->key_id);
        ctx->key_id = 0;
        ctx->key_imported = false;
    }

    psa_status_t status = psa_crypto_init();
    if (status != PSA_SUCCESS) {
        return (int)status;
    }

    psa_key_attributes_t attributes = PSA_KEY_ATTRIBUTES_INIT;
    psa_set_key_usage_flags(&attributes, PSA_KEY_USAGE_ENCRYPT);
    psa_set_key_algorithm(&attributes, PSA_ALG_CTR);
    psa_set_key_type(&attributes, PSA_KEY_TYPE_AES);
    psa_set_key_bits(&attributes, key_bits);

    status = psa_import_key(&attributes, key, key_bits / 8, &ctx->key_id);
    psa_reset_key_attributes(&attributes);
    if (status != PSA_SUCCESS) {
        ctx->key_id = 0;
        return (int)status;
    }

    ctx->key_imported = true;
    return 0;
#else
    return mbedtls_aes_setkey_enc(ctx, key, (unsigned int)key_bits);
#endif
}

static int esp_xiaozhi_chat_aes_ctr_crypt(esp_xiaozhi_chat_aes_ctr_context_t *ctx,
                                          size_t length,
                                          uint8_t nonce_counter[ESP_XIAOZHI_CHAT_AES_NONCE_SIZE],
                                          const uint8_t *input,
                                          uint8_t *output)
{
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
    if (!ctx->key_imported) {
        return PSA_ERROR_BAD_STATE;
    }

