waveshareteam/ESP32-S3-Touch-AMOLED-1.75/firmware/brookesia/components/esp_xiaozhi_safe/esp_xiaozhi/src/esp_xiaozhi_chat.c
    psa_cipher_operation_t operation = PSA_CIPHER_OPERATION_INIT;
    psa_status_t status = psa_cipher_encrypt_setup(&operation, ctx->key_id, PSA_ALG_CTR);
    if (status != PSA_SUCCESS) {
        return (int)status;
    }

    status = psa_cipher_set_iv(&operation, nonce_counter, ESP_XIAOZHI_CHAT_AES_NONCE_SIZE);
    if (status != PSA_SUCCESS) {
        psa_cipher_abort(&operation);
        return (int)status;
    }

    size_t output_len = 0;
    status = psa_cipher_update(&operation, input, length, output, length, &output_len);
    if (status != PSA_SUCCESS) {
        psa_cipher_abort(&operation);
        return (int)status;
    }

    uint8_t finish_buf[16] = {0};
    size_t finish_len = 0;
    status = psa_cipher_finish(&operation, finish_buf, sizeof(finish_buf), &finish_len);
    if (status != PSA_SUCCESS) {
        psa_cipher_abort(&operation);
        return (int)status;
    }

    return (output_len == length && finish_len == 0) ? 0 : PSA_ERROR_GENERIC_ERROR;
#else
    size_t nc_off = 0;
    uint8_t stream_block[ESP_XIAOZHI_CHAT_AES_NONCE_SIZE] = {0};
    return mbedtls_aes_crypt_ctr(ctx, length, &nc_off, nonce_counter, stream_block, input, output);
#endif
}

static void esp_xiaozhi_chat_aes_ctr_free(esp_xiaozhi_chat_aes_ctr_context_t *ctx)
{
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
    if (ctx->key_imported) {
        psa_destroy_key(ctx->key_id);
        ctx->key_id = 0;
        ctx->key_imported = false;
    }
#else
    mbedtls_aes_free(ctx);
#endif
}

static esp_xiaozhi_chat_t *esp_xiaozhi_chat_get_instance(void)
{
    esp_xiaozhi_chat_t *xiaozhi_chat = NULL;

    portENTER_CRITICAL(&s_xiaozhi_chat_lock);
    xiaozhi_chat = s_xiaozhi_chat;
    portEXIT_CRITICAL(&s_xiaozhi_chat_lock);

    return xiaozhi_chat;
}

static esp_err_t esp_xiaozhi_chat_register_instance(esp_xiaozhi_chat_t *xiaozhi_chat)
{
    ESP_RETURN_ON_FALSE(xiaozhi_chat != NULL, ESP_ERR_INVALID_ARG, TAG, "Invalid chat instance");

    esp_err_t ret = ESP_OK;
    portENTER_CRITICAL(&s_xiaozhi_chat_lock);
    if (s_xiaozhi_chat != NULL) {
        ret = ESP_ERR_INVALID_STATE;
    } else {
        s_xiaozhi_chat = xiaozhi_chat;
    }
    portEXIT_CRITICAL(&s_xiaozhi_chat_lock);

    return ret;
}

static void esp_xiaozhi_chat_unregister_instance(esp_xiaozhi_chat_t *xiaozhi_chat)
{
    portENTER_CRITICAL(&s_xiaozhi_chat_lock);
    if (s_xiaozhi_chat == xiaozhi_chat) {
        s_xiaozhi_chat = NULL;
    }
    portEXIT_CRITICAL(&s_xiaozhi_chat_lock);
}

static uint8_t char_to_hex(char c)
{
    if (c >= '0' && c <= '9') {
        return c - '0';
    }
    if (c >= 'A' && c <= 'F') {
        return c - 'A' + 10;
    }
    if (c >= 'a' && c <= 'f') {
        return c - 'a' + 10;
    }
    return 0;
}

static void esp_xiaozhi_chat_decode_hex_string(const char *hex_string, uint8_t *output, size_t output_size)
{
    if (!hex_string || !output) {
        return;
    }

    size_t hex_len = strlen(hex_string);
    size_t decode_len = hex_len / 2;
    if (decode_len > output_size) {
        decode_len = output_size;
    }

    for (size_t i = 0; i < decode_len; i++) {
        output[i] = (char_to_hex(hex_string[i * 2]) << 4) | char_to_hex(hex_string[i * 2 + 1]);
    }
}

static esp_xiaozhi_chat_t *esp_xiaozhi_chat_get_by_transport(esp_xiaozhi_transport_handle_t handle)
{
    esp_xiaozhi_chat_t *xiaozhi_chat = esp_xiaozhi_chat_get_instance();
    if (xiaozhi_chat && xiaozhi_chat->mcp_chat_handle == handle) {
        return xiaozhi_chat;
    }

    return NULL;
}

static bool esp_xiaozhi_chat_is_audio_ready(esp_xiaozhi_chat_t *xiaozhi_chat)
{
    ESP_RETURN_ON_FALSE(xiaozhi_chat, false, TAG, "Invalid chat");

    if (!xiaozhi_chat->audio_channel_opened || xiaozhi_chat->error_occurred) {
        return false;
    }
    if (!xiaozhi_chat->use_mqtt) {
        return true;
    }
    return xiaozhi_chat->udp != NULL && xiaozhi_chat->udp->udp_socket != -1;
}

static esp_err_t esp_xiaozhi_chat_set_listening_mode(esp_xiaozhi_chat_t *xiaozhi_chat, esp_xiaozhi_chat_listening_mode_t mode)
{
    const char *const mode_str[] = {
        "unknown",
        "realtime",
        "auto",
        "manual",
        "manual_stop",
        "auto_stop"
    };

    if (xiaozhi_chat->listening_mode == mode) {
        ESP_LOGD(TAG, "Listening mode is already %s", mode_str[mode]);
        return ESP_OK;
    }

    xiaozhi_chat->listening_mode = mode;
    ESP_LOGD(TAG, "Listening mode: %s", mode_str[mode]);

    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_set_device_state(esp_xiaozhi_chat_t *xiaozhi_chat, esp_xiaozhi_chat_device_state_t state)
{
    if (xiaozhi_chat->device_state == state) {
        ESP_LOGD(TAG, "Device state(%d) is already", state);
        return ESP_OK;
    }
    xiaozhi_chat->device_state = state;
    ESP_LOGD(TAG, "Device state: %d", xiaozhi_chat->device_state);
    /* App derives device state from CHAT_TTS_STATE / connection events; no CHAT_STATE event */
    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_hello_handler(esp_xiaozhi_chat_t *xiaozhi_chat, cJSON *root)
{
    const cJSON *transport = cJSON_GetObjectItem(root, "transport");
    if (!transport || !cJSON_IsString(transport) ||
            (strcmp(transport->valuestring, "udp") != 0 && strcmp(transport->valuestring, "websocket") != 0)) {
        ESP_LOGE(TAG, "Unsupported transport: %s", transport ? transport->valuestring : "null");
        return ESP_ERR_INVALID_ARG;
    }

    const cJSON *session_id = cJSON_GetObjectItem(root, "session_id");
    if (cJSON_IsString(session_id)) {
        uint16_t session_id_len = strlen(session_id->valuestring);
        if (session_id_len > sizeof(xiaozhi_chat->session_id) - 1) {
            ESP_LOGE(TAG, "Session ID is too long: %u > %u", session_id_len, sizeof(xiaozhi_chat->session_id) - 1);
            return ESP_ERR_INVALID_ARG;
        }
        for (uint16_t i = 0; i < session_id_len; i++) {
            char c = session_id->valuestring[i];
            if (!isalnum((unsigned char)c) && c != '-' && c != '_') {
                ESP_LOGE(TAG, "Invalid session ID character at position %u", i);
                return ESP_ERR_INVALID_ARG;
            }
        }
        memcpy(xiaozhi_chat->session_id, session_id->valuestring, session_id_len);
        xiaozhi_chat->session_id[session_id_len] = '\0';
        ESP_LOGD(TAG, "Session established");
    }

    const cJSON *audio_params = cJSON_GetObjectItem(root, "audio_params");
    if (cJSON_IsObject(audio_params)) {
        const cJSON *sample_rate = cJSON_GetObjectItem(audio_params, "sample_rate");
        if (cJSON_IsNumber(sample_rate)) {
            xiaozhi_chat->server_sample_rate = sample_rate->valueint;
        }

        const cJSON *frame_duration = cJSON_GetObjectItem(audio_params, "frame_duration");
        if (cJSON_IsNumber(frame_duration)) {
            xiaozhi_chat->server_frame_duration = frame_duration->valueint;
        }
    }

