waveshareteam/ESP32-S3-Touch-AMOLED-1.75/firmware/brookesia/components/esp_xiaozhi_safe/esp_xiaozhi/src/esp_xiaozhi_chat.c
    if (strcmp(transport->valuestring, "udp") == 0) {
        const cJSON *udp = cJSON_GetObjectItem(root, "udp");
        if (!cJSON_IsObject(udp)) {
            ESP_LOGE(TAG, "UDP is not specified");
            return ESP_ERR_INVALID_ARG;
        }

        const cJSON *server = cJSON_GetObjectItem(udp, "server");
        const cJSON *port = cJSON_GetObjectItem(udp, "port");
        const cJSON *key = cJSON_GetObjectItem(udp, "key");
        const cJSON *nonce = cJSON_GetObjectItem(udp, "nonce");

        if (xiaozhi_chat->udp) {
            if (server && cJSON_IsString(server)) {
                uint16_t server_len = strlen(server->valuestring);
                if (server_len > sizeof(xiaozhi_chat->udp->udp_server) - 1) {
                    ESP_LOGE(TAG, "Server is too long: %u > %u", server_len, sizeof(xiaozhi_chat->udp->udp_server) - 1);
                    return ESP_ERR_INVALID_ARG;
                }
                memcpy(xiaozhi_chat->udp->udp_server, server->valuestring, server_len);
                xiaozhi_chat->udp->udp_server[server_len] = '\0';
            }
            if (port && cJSON_IsNumber(port)) {
                if (port->valueint <= ESP_XIAOZHI_CHAT_UDP_MIN_PORT || port->valueint > ESP_XIAOZHI_CHAT_UDP_MAX_PORT) {
                    ESP_LOGE(TAG, "Invalid port: %d", port->valueint);
                    return ESP_ERR_INVALID_ARG;
                }
                xiaozhi_chat->udp->udp_port = port->valueint;
            }
            if (key && cJSON_IsString(key) && nonce && cJSON_IsString(nonce)) {
                uint8_t aes_key[ESP_XIAOZHI_CHAT_AES_KEY_SIZE] = {0};
                size_t nonce_len = strlen(nonce->valuestring);
                size_t key_len = strlen(key->valuestring);
                if (nonce_len != ESP_XIAOZHI_CHAT_AES_NONCE_SIZE * 2) {
                    ESP_LOGE(TAG, "Invalid nonce length: %zu (expected %zu)", nonce_len, ESP_XIAOZHI_CHAT_AES_NONCE_SIZE * 2);
                    return ESP_ERR_INVALID_ARG;
                }
                if (key_len != ESP_XIAOZHI_CHAT_AES_KEY_SIZE * 2) {
                    ESP_LOGE(TAG, "Invalid key length: %d (expected %d)", key_len, ESP_XIAOZHI_CHAT_AES_KEY_SIZE * 2);
                    return ESP_ERR_INVALID_ARG;
                }
                for (size_t i = 0; i < nonce_len; i++) {
                    if (!isxdigit((unsigned char)nonce->valuestring[i])) {
                        ESP_LOGE(TAG, "Invalid nonce character at position %zu", i);
                        return ESP_ERR_INVALID_ARG;
                    }
                }
                for (size_t i = 0; i < key_len; i++) {
                    if (!isxdigit((unsigned char)key->valuestring[i])) {
                        ESP_LOGE(TAG, "Invalid key character at position %zu", i);
                        return ESP_ERR_INVALID_ARG;
                    }
                }
                esp_xiaozhi_chat_decode_hex_string(nonce->valuestring, xiaozhi_chat->udp->aes_nonce, ESP_XIAOZHI_CHAT_AES_NONCE_SIZE);
                esp_xiaozhi_chat_decode_hex_string(key->valuestring, aes_key, ESP_XIAOZHI_CHAT_AES_KEY_SIZE);

                int aes_ret = esp_xiaozhi_chat_aes_ctr_setkey(&xiaozhi_chat->udp->aes_ctx, aes_key, 128);
                memset(aes_key, 0, ESP_XIAOZHI_CHAT_AES_KEY_SIZE);
                if (aes_ret != 0) {
                    ESP_LOGE(TAG, "Failed to set AES key: %d", aes_ret);
                    return ESP_FAIL;
                }

                xiaozhi_chat->udp->local_sequence = 0;
                xiaozhi_chat->udp->remote_sequence = 0;
            }
        }
    }
    xEventGroupSetBits(xiaozhi_chat->event_group_handle, ESP_XIAOZHI_CHAT_SERVER_HELLO);

    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_goodbye_handler(esp_xiaozhi_chat_t *xiaozhi_chat, cJSON *root)
{
    cJSON *session_id = cJSON_GetObjectItem(root, "session_id");
    if (session_id == NULL || strcmp(xiaozhi_chat->session_id, session_id->valuestring) == 0) {
        esp_event_post(ESP_XIAOZHI_CHAT_EVENTS, ESP_XIAOZHI_CHAT_EVENT_SERVER_GOODBYE, NULL, 0,
                       ESP_XIAOZHI_EVENT_POST_TIMEOUT);
    }

    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_mcp_handler(esp_xiaozhi_chat_t *xiaozhi_chat, cJSON *root)
{
    cJSON *payload_obj = cJSON_GetObjectItem(root, "payload");
    if (!payload_obj || !cJSON_IsObject(payload_obj)) {
        ESP_LOGE(TAG, "Invalid MCP payload");
        return ESP_ERR_INVALID_ARG;
    }

    if (!xiaozhi_chat->mcp_mgr_handle) {
        ESP_LOGW(TAG, "MCP manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }

    cJSON *method = cJSON_GetObjectItem(payload_obj, "method");
    if (cJSON_IsString(method)) {
        ESP_LOGI(TAG, "Received MCP method: %s", method->valuestring);
    }

    char *payload_mcp = cJSON_PrintUnformatted(payload_obj);
    if (!payload_mcp) {
        ESP_LOGE(TAG, "Failed to print MCP payload");
        return ESP_ERR_NO_MEM;
    }

    ESP_LOGI(TAG, "Received MCP message: %s", payload_mcp);

    esp_err_t ret = esp_xiaozhi_mcp_handle_message(xiaozhi_chat->mcp_mgr_handle,
                                                   "mcp_server",
                                                   payload_mcp,
                                                   strlen(payload_mcp),
                                                   xiaozhi_chat->session_id);

    cJSON_free(payload_mcp);

    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Failed to process MCP message: %s", esp_err_to_name(ret));
    }

    return ret;
}

static esp_err_t esp_xiaozhi_chat_tts_handler(esp_xiaozhi_chat_t *xiaozhi_chat, cJSON *root)
{
    cJSON *state = cJSON_GetObjectItem(root, "state");
    if (!cJSON_IsString(state)) {
        return ESP_OK;
    }
    ESP_LOGD(TAG, "TTS state: %s", state->valuestring);

    if (xiaozhi_chat->event_callback == NULL) {
        return ESP_OK;
    }

    if (strcmp(state->valuestring, "start") == 0) {
        esp_xiaozhi_chat_tts_state_t tts_state = {
            .state = ESP_XIAOZHI_CHAT_TTS_STATE_START,
            .text = NULL,
        };
        xiaozhi_chat->event_callback(ESP_XIAOZHI_CHAT_EVENT_CHAT_TTS_STATE, &tts_state, xiaozhi_chat->event_callback_ctx);
        xiaozhi_chat->event_callback(ESP_XIAOZHI_CHAT_EVENT_CHAT_SPEECH_STARTED, NULL, xiaozhi_chat->event_callback_ctx);
    } else if (strcmp(state->valuestring, "stop") == 0) {
        esp_xiaozhi_chat_tts_state_t tts_state = {
            .state = ESP_XIAOZHI_CHAT_TTS_STATE_STOP,
            .text = NULL,
        };
        xiaozhi_chat->event_callback(ESP_XIAOZHI_CHAT_EVENT_CHAT_TTS_STATE, &tts_state, xiaozhi_chat->event_callback_ctx);
        xiaozhi_chat->event_callback(ESP_XIAOZHI_CHAT_EVENT_CHAT_SPEECH_STOPPED, NULL, xiaozhi_chat->event_callback_ctx);
    } else if (strcmp(state->valuestring, "sentence_start") == 0) {
        cJSON *text = cJSON_GetObjectItem(root, "text");
        const char *text_str = (cJSON_IsString(text)) ? text->valuestring : NULL;
        if (text_str) {
            ESP_LOGD(TAG, "TTS sentence text: %s", text_str);
            esp_xiaozhi_chat_tts_state_t tts_state = {
                .state = ESP_XIAOZHI_CHAT_TTS_STATE_SENTENCE_START,
                .text = text_str,
            };
            xiaozhi_chat->event_callback(ESP_XIAOZHI_CHAT_EVENT_CHAT_TTS_STATE, &tts_state, xiaozhi_chat->event_callback_ctx);
            esp_xiaozhi_chat_text_data_t text_data = {
                .role = ESP_XIAOZHI_CHAT_TEXT_ROLE_ASSISTANT,
                .text = text_str,
            };
            xiaozhi_chat->event_callback(ESP_XIAOZHI_CHAT_EVENT_CHAT_TEXT, &text_data, xiaozhi_chat->event_callback_ctx);
        }
    }

    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_stt_handler(esp_xiaozhi_chat_t *xiaozhi_chat, cJSON *root)
{
    cJSON *text = cJSON_GetObjectItem(root, "text");
    if (cJSON_IsString(text)) {
        ESP_LOGD(TAG, "STT text: %s", text->valuestring);
        esp_xiaozhi_chat_text_data_t text_data = {
            .role = ESP_XIAOZHI_CHAT_TEXT_ROLE_USER,
            .text = text->valuestring,
        };
        if (xiaozhi_chat->event_callback) {
            xiaozhi_chat->event_callback(ESP_XIAOZHI_CHAT_EVENT_CHAT_TEXT, &text_data, xiaozhi_chat->event_callback_ctx);
        }
    }

    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_llm_handler(esp_xiaozhi_chat_t *xiaozhi_chat, cJSON *root)
{
    cJSON *emotion = cJSON_GetObjectItem(root, "emotion");
    if (cJSON_IsString(emotion)) {
        ESP_LOGD(TAG, "LLM emotion: %s", emotion->valuestring);
        if (xiaozhi_chat->event_callback) {
            xiaozhi_chat->event_callback(ESP_XIAOZHI_CHAT_EVENT_CHAT_EMOJI, emotion->valuestring, xiaozhi_chat->event_callback_ctx);
        }
    }

    return ESP_OK;
}

