waveshareteam/ESP32-S3-Touch-AMOLED-1.75/firmware/brookesia/components/esp_xiaozhi_safe/esp_xiaozhi/src/esp_xiaozhi_chat.c
static esp_err_t esp_xiaozhi_chat_system_handler(esp_xiaozhi_chat_t *xiaozhi_chat, cJSON *root)
{
    cJSON *command = cJSON_GetObjectItem(root, "command");
    if (!cJSON_IsString(command)) {
        return ESP_OK;
    }
    ESP_LOGD(TAG, "System command: %s", command->valuestring);
    /* Protocol layer only reports; app decides whether to execute (e.g. esp_restart for "reboot") */
    if (xiaozhi_chat->event_callback) {
        xiaozhi_chat->event_callback(ESP_XIAOZHI_CHAT_EVENT_CHAT_SYSTEM_CMD, command->valuestring, xiaozhi_chat->event_callback_ctx);
    }
    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_binary_handler(esp_xiaozhi_transport_handle_t handle, const uint8_t *data, size_t data_len)
{
    esp_xiaozhi_chat_t *xiaozhi_chat = esp_xiaozhi_chat_get_by_transport(handle);
    if (!xiaozhi_chat) {
        return ESP_ERR_INVALID_ARG;
    }

    if (xiaozhi_chat->audio_callback) {
        xiaozhi_chat->audio_callback(data, data_len, xiaozhi_chat->audio_callback_ctx);
    }

    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_data_handler(esp_xiaozhi_transport_handle_t handle, const char *topic, size_t topic_len, const char *data, size_t data_len)
{
    esp_xiaozhi_chat_t *xiaozhi_chat = esp_xiaozhi_chat_get_by_transport(handle);
    if (!xiaozhi_chat) {
        return ESP_ERR_INVALID_ARG;
    }

    cJSON *root = cJSON_ParseWithLength(data, data_len);
    if (root == NULL) {
        ESP_LOGE(TAG, "Failed to parse JSON message: %.*s", (int)data_len, data);
        return ESP_ERR_INVALID_ARG;
    }

    cJSON *type = cJSON_GetObjectItem(root, "type");
    if (!cJSON_IsString(type)) {
        ESP_LOGE(TAG, "Message type is invalid");
        cJSON_Delete(root);
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t ret = ESP_OK;
    esp_xiaozhi_chat_type_func_t esp_xiaozhi_chat_type_handlers[] = {
        { "hello",   esp_xiaozhi_chat_hello_handler },
        { "goodbye", esp_xiaozhi_chat_goodbye_handler },
        { "mcp",     esp_xiaozhi_chat_mcp_handler },
        { "tts",     esp_xiaozhi_chat_tts_handler },
        { "stt",     esp_xiaozhi_chat_stt_handler },
        { "llm",     esp_xiaozhi_chat_llm_handler },
        { "system",  esp_xiaozhi_chat_system_handler },
    };

    for (size_t i = 0; i < sizeof(esp_xiaozhi_chat_type_handlers) / sizeof(esp_xiaozhi_chat_type_handlers[0]); i++) {
        if (strcmp(type->valuestring, esp_xiaozhi_chat_type_handlers[i].type) == 0) {
            ret = esp_xiaozhi_chat_type_handlers[i].handler(xiaozhi_chat, root);
            break;
        }
    }

    cJSON_Delete(root);

    return ret;
}

static esp_err_t esp_xiaozhi_chat_connected_handler(esp_xiaozhi_transport_handle_t handle)
{
    esp_xiaozhi_chat_t *xiaozhi_chat = esp_xiaozhi_chat_get_by_transport(handle);
    ESP_RETURN_ON_FALSE(xiaozhi_chat, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    xiaozhi_chat->chat_connected = true;

    esp_event_post(ESP_XIAOZHI_CHAT_EVENTS, ESP_XIAOZHI_CHAT_EVENT_CONNECTED, NULL, 0,
                   ESP_XIAOZHI_EVENT_POST_TIMEOUT);

    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_disconnected_handler(esp_xiaozhi_transport_handle_t handle)
{
    esp_xiaozhi_chat_t *xiaozhi_chat = esp_xiaozhi_chat_get_by_transport(handle);
    ESP_RETURN_ON_FALSE(xiaozhi_chat, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    xiaozhi_chat->chat_connected = false;

    esp_event_post(ESP_XIAOZHI_CHAT_EVENTS, ESP_XIAOZHI_CHAT_EVENT_DISCONNECTED, NULL, 0,
                   ESP_XIAOZHI_EVENT_POST_TIMEOUT);

    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_transport_error_handler(esp_xiaozhi_transport_handle_t handle, esp_err_t err)
{
    esp_xiaozhi_chat_t *xiaozhi_chat = esp_xiaozhi_chat_get_by_transport(handle);
    ESP_RETURN_ON_FALSE(xiaozhi_chat, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    if (xiaozhi_chat->event_callback) {
        esp_xiaozhi_chat_error_info_t info = {
            .code = err,
            .source = "transport",
        };
        xiaozhi_chat->event_callback(ESP_XIAOZHI_CHAT_EVENT_CHAT_ERROR, &info, xiaozhi_chat->event_callback_ctx);
    }
    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_send_json_message(esp_xiaozhi_chat_t *xiaozhi_chat, cJSON *root)
{
    ESP_RETURN_ON_FALSE(xiaozhi_chat, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");
    ESP_RETURN_ON_FALSE(root, ESP_ERR_INVALID_ARG, TAG, "Invalid root");

    char *json_str = cJSON_PrintUnformatted(root);
    ESP_RETURN_ON_FALSE(json_str, ESP_ERR_NO_MEM, TAG, "Failed to print JSON");

    esp_err_t ret = esp_xiaozhi_transport_send_text(xiaozhi_chat->mcp_chat_handle, json_str);
    cJSON_free(json_str);

    return ret;
}

static esp_err_t esp_xiaozhi_chat_create_session_message(esp_xiaozhi_chat_t *xiaozhi_chat, const char *type, cJSON **out_root)
{
    ESP_RETURN_ON_FALSE(xiaozhi_chat != NULL, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");
    ESP_RETURN_ON_FALSE(type != NULL, ESP_ERR_INVALID_ARG, TAG, "Invalid type");
    ESP_RETURN_ON_FALSE(out_root != NULL, ESP_ERR_INVALID_ARG, TAG, "Invalid output");
    ESP_RETURN_ON_FALSE(strlen(xiaozhi_chat->session_id) > 0, ESP_ERR_INVALID_STATE, TAG, "No session, open audio channel first");

    cJSON *root = cJSON_CreateObject();
    ESP_RETURN_ON_FALSE(root != NULL, ESP_ERR_NO_MEM, TAG, "Failed to create JSON object");

    cJSON_AddStringToObject(root, "session_id", xiaozhi_chat->session_id);
    cJSON_AddStringToObject(root, "type", type);
    *out_root = root;
    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_validate_audio_params(const esp_xiaozhi_chat_audio_t *audio)
{
    if (audio == NULL) {
        return ESP_OK;
    }

    ESP_RETURN_ON_FALSE(audio->format == NULL || audio->format[0] != '\0', ESP_ERR_INVALID_ARG, TAG, "Audio format must not be empty");
    ESP_RETURN_ON_FALSE(audio->sample_rate == 0 ||
                        (audio->sample_rate >= ESP_XIAOZHI_CHAT_MIN_SAMPLE_RATE &&
                         audio->sample_rate <= ESP_XIAOZHI_CHAT_MAX_SAMPLE_RATE),
                        ESP_ERR_INVALID_ARG, TAG, "Audio sample_rate out of range");
    ESP_RETURN_ON_FALSE(audio->channels == 0 ||
                        (audio->channels >= ESP_XIAOZHI_CHAT_MIN_CHANNELS &&
                         audio->channels <= ESP_XIAOZHI_CHAT_MAX_CHANNELS),
                        ESP_ERR_INVALID_ARG, TAG, "Audio channels out of range");
    ESP_RETURN_ON_FALSE(audio->frame_duration == 0 ||
                        (audio->frame_duration >= ESP_XIAOZHI_CHAT_MIN_FRAME_DURATION_MS &&
                         audio->frame_duration <= ESP_XIAOZHI_CHAT_MAX_FRAME_DURATION_MS),
                        ESP_ERR_INVALID_ARG, TAG, "Audio frame_duration out of range");

    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_get_hello_message(esp_xiaozhi_chat_t *xiaozhi_chat, const esp_xiaozhi_chat_audio_t *audio,
                                                    char *message, uint16_t message_len)
{
    const char *format = (audio && audio->format && audio->format[0] != '\0') ? audio->format : "opus";
    int sample_rate = (audio && audio->sample_rate > 0) ? audio->sample_rate : 16000;
    int channels = (audio && audio->channels > 0) ? audio->channels : 1;
    int frame_duration = (audio && audio->frame_duration > 0) ? audio->frame_duration : 60;

    cJSON *root = cJSON_CreateObject();
    ESP_RETURN_ON_FALSE(root, ESP_ERR_NO_MEM, TAG, "Failed to create JSON object");

    cJSON_AddStringToObject(root, "type", "hello");
    if (xiaozhi_chat->use_mqtt) {
        cJSON_AddNumberToObject(root, "version", 3);
        cJSON_AddStringToObject(root, "transport", "udp");
    } else {
        cJSON_AddNumberToObject(root, "version", 1);
        cJSON_AddStringToObject(root, "transport", "websocket");
    }

