waveshareteam/ESP32-S3-Touch-AMOLED-1.75/firmware/brookesia/components/esp_xiaozhi_safe/esp_xiaozhi/src/esp_xiaozhi_chat.c
    cJSON *features = cJSON_CreateObject();
    if (!features) {
        cJSON_Delete(root);
        return ESP_ERR_NO_MEM;
    }

    cJSON_AddBoolToObject(features, "mcp", true);
    cJSON_AddItemToObject(root, "features", features);

    cJSON *audio_params = cJSON_CreateObject();
    if (!audio_params) {
        cJSON_Delete(root);
        return ESP_ERR_NO_MEM;
    }

    cJSON_AddStringToObject(audio_params, "format", format);
    cJSON_AddNumberToObject(audio_params, "sample_rate", sample_rate);
    cJSON_AddNumberToObject(audio_params, "channels", channels);
    cJSON_AddNumberToObject(audio_params, "frame_duration", frame_duration);
    cJSON_AddItemToObject(root, "audio_params", audio_params);

    char *json_str = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);
    ESP_RETURN_ON_FALSE(json_str, ESP_ERR_NO_MEM, TAG, "Failed to print JSON");

    uint16_t json_len = (uint16_t)strlen(json_str);
    if (json_len >= message_len) {
        cJSON_free(json_str);
        ESP_LOGE(TAG, "Hello message buffer too small: need %u, have %u", json_len + 1, message_len);
        return ESP_ERR_INVALID_SIZE;
    }
    memcpy(message, json_str, json_len + 1);
    cJSON_free(json_str);

    return ESP_OK;
}

static void esp_xiaozhi_chat_audio_input_exit(EventGroupHandle_t evt)
{
    if (evt != NULL) {
        xEventGroupSetBits(evt, ESP_XIAOZHI_CHAT_RECV_TASK_EXITED);
    }
    vTaskDelete(NULL);
}

static esp_err_t esp_xiaozhi_chat_create_audio_input_task(esp_xiaozhi_chat_t *xiaozhi_chat)
{
    BaseType_t core = (CONFIG_XIAOZHI_AUDIO_TASK_CORE < 0) ? tskNO_AFFINITY : CONFIG_XIAOZHI_AUDIO_TASK_CORE;
    TaskHandle_t task_handle = NULL;

#if CONFIG_XIAOZHI_AUDIO_TASK_ALLOC_STATIC
    memset(&s_audio_input_task_tcb, 0, sizeof(s_audio_input_task_tcb));
    task_handle = xTaskCreateStaticPinnedToCore(esp_xiaozhi_chat_audio_input,
                                                ESP_XIAOZHI_CHAT_TASK_NAME,
                                                CONFIG_XIAOZHI_AUDIO_TASK_STACK_SIZE,
                                                xiaozhi_chat,
                                                CONFIG_XIAOZHI_AUDIO_TASK_PRIORITY,
                                                s_audio_input_task_stack,
                                                &s_audio_input_task_tcb,
                                                core);
    ESP_RETURN_ON_FALSE(task_handle != NULL, ESP_ERR_NO_MEM, TAG, "Failed to create audio input task");
#else
    UBaseType_t stack_caps = CONFIG_XIAOZHI_STACK_IN_PSRAM
                             ? (MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT)
                             : (MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    BaseType_t task_ret = xTaskCreatePinnedToCoreWithCaps(esp_xiaozhi_chat_audio_input,
                                                          ESP_XIAOZHI_CHAT_TASK_NAME,
                                                          CONFIG_XIAOZHI_AUDIO_TASK_STACK_SIZE,
                                                          xiaozhi_chat,
                                                          CONFIG_XIAOZHI_AUDIO_TASK_PRIORITY,
                                                          &task_handle,
                                                          core,
                                                          stack_caps);
    if (task_ret != pdPASS && CONFIG_XIAOZHI_STACK_IN_PSRAM) {
        ESP_LOGW(TAG, "Audio task PSRAM allocation failed, retrying with internal memory");
        stack_caps = MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT;
        task_ret = xTaskCreatePinnedToCoreWithCaps(esp_xiaozhi_chat_audio_input,
                                                   ESP_XIAOZHI_CHAT_TASK_NAME,
                                                   CONFIG_XIAOZHI_AUDIO_TASK_STACK_SIZE,
                                                   xiaozhi_chat,
                                                   CONFIG_XIAOZHI_AUDIO_TASK_PRIORITY,
                                                   &task_handle,
                                                   core,
                                                   stack_caps);
    }
    ESP_RETURN_ON_FALSE(task_ret == pdPASS && task_handle != NULL, ESP_ERR_NO_MEM, TAG, "Failed to create audio input task");
#endif
    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_stop_runtime(esp_xiaozhi_chat_t *xiaozhi_chat)
{
    ESP_RETURN_ON_FALSE(xiaozhi_chat != NULL, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    esp_err_t ret = ESP_OK;
    esp_err_t step_ret = esp_xiaozhi_chat_close_audio_channel((esp_xiaozhi_chat_handle_t)xiaozhi_chat);
    if (step_ret != ESP_OK) {
        ESP_LOGW(TAG, "Failed to close audio channel during stop: %s", esp_err_to_name(step_ret));
        ret = step_ret;
    }

    if (xiaozhi_chat->mcp_mgr_handle != 0) {
        step_ret = esp_mcp_mgr_stop(xiaozhi_chat->mcp_mgr_handle);
        if (step_ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to stop MCP manager during stop: %s", esp_err_to_name(step_ret));
            if (ret == ESP_OK) {
                ret = step_ret;
            }
        }

        step_ret = esp_mcp_mgr_deinit(xiaozhi_chat->mcp_mgr_handle);
        if (step_ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to deinit MCP manager during stop: %s", esp_err_to_name(step_ret));
            /* This failure is critical: the manager still owns live state. */
            ret = step_ret;
        } else {
            xiaozhi_chat->mcp_mgr_handle = 0;
            xiaozhi_chat->mcp_chat_handle = 0;
        }
    }

    if (xiaozhi_chat->mcp_mgr_handle == 0) {
        xiaozhi_chat->mcp_chat_handle = 0;
    }

    return ret;
}

static esp_err_t esp_xiaozhi_chat_destroy_owned_resources(esp_xiaozhi_chat_t *xiaozhi_chat)
{
    ESP_RETURN_ON_FALSE(xiaozhi_chat != NULL, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    if (xiaozhi_chat->owns_mcp_engine && xiaozhi_chat->mcp_engine != NULL) {
        esp_err_t ret = esp_mcp_destroy(xiaozhi_chat->mcp_engine);
        if (ret == ESP_OK) {
            xiaozhi_chat->mcp_engine = NULL;
        }
        return ret;
    }

    return ESP_OK;
}

static void esp_xiaozhi_chat_udp_force_close_socket(esp_xiaozhi_chat_t *xiaozhi_chat)
{
    if (xiaozhi_chat == NULL || xiaozhi_chat->udp == NULL) {
        return;
    }

    int sockfd = xiaozhi_chat->udp->udp_socket;
    xiaozhi_chat->udp->udp_socket = -1;
    xiaozhi_chat->audio_channel_opened = false;
    xiaozhi_chat->udp->local_sequence = 0;
    xiaozhi_chat->udp->remote_sequence = 0;
    if (xiaozhi_chat->udp->audio_receive_events != NULL) {
        xEventGroupClearBits(xiaozhi_chat->udp->audio_receive_events, ESP_XIAOZHI_CHAT_RECV_RECEIVE_ENABLED);
    }

    if (sockfd != -1) {
        shutdown(sockfd, SHUT_RDWR);
        close(sockfd);
    }
}

static void esp_xiaozhi_chat_release_internal_resources(esp_xiaozhi_chat_t *xiaozhi_chat)
{
    if (xiaozhi_chat == NULL) {
        return;
    }

    if (xiaozhi_chat->udp != NULL) {
        esp_xiaozhi_chat_udp_force_close_socket(xiaozhi_chat);
        esp_xiaozhi_chat_aes_ctr_free(&xiaozhi_chat->udp->aes_ctx);
        if (xiaozhi_chat->udp->audio_receive_events != NULL) {
            vEventGroupDelete(xiaozhi_chat->udp->audio_receive_events);
            xiaozhi_chat->udp->audio_receive_events = NULL;
        }
        if (xiaozhi_chat->udp->channel_mutex != NULL) {
            vSemaphoreDelete(xiaozhi_chat->udp->channel_mutex);
            xiaozhi_chat->udp->channel_mutex = NULL;
        }
        free(xiaozhi_chat->udp);
        xiaozhi_chat->udp = NULL;
    }

    if (xiaozhi_chat->event_group_handle != NULL) {
        vEventGroupDelete(xiaozhi_chat->event_group_handle);
        xiaozhi_chat->event_group_handle = NULL;
    }
}

static void esp_xiaozhi_chat_audio_input(void *pvParameter)
{
    esp_xiaozhi_chat_t *xiaozhi_chat = (esp_xiaozhi_chat_t *)pvParameter;
    EventGroupHandle_t evt = NULL;
    if (!xiaozhi_chat || !xiaozhi_chat->udp || !xiaozhi_chat->udp->audio_receive_events) {
        ESP_LOGE(TAG, "Invalid parameter in audio input task");
        vTaskDelete(NULL);
        return;
    }

    evt = xiaozhi_chat->udp->audio_receive_events;
    xEventGroupClearBits(evt, ESP_XIAOZHI_CHAT_RECV_TASK_EXITED);

    char *buffer = calloc(1, CONFIG_XIAOZHI_UDP_RECEIVE_BUFFER_SIZE);
    if (!buffer) {
        ESP_LOGE(TAG, "Failed to allocate UDP receive buffer");
        esp_xiaozhi_chat_audio_input_exit(evt);
        return;
    }

    uint8_t *decrypted_data = NULL;
    int consecutive_errors = 0;

