waveshareteam/ESP32-S3-Touch-AMOLED-1.75/firmware/brookesia/components/esp_xiaozhi_safe/esp_xiaozhi/src/esp_xiaozhi_chat.c
    for (;;) {
        uint32_t bits = xEventGroupWaitBits(evt,
                                            ESP_XIAOZHI_CHAT_RECV_RECEIVE_ENABLED | ESP_XIAOZHI_CHAT_RECV_SHUTDOWN,
                                            pdFALSE, pdFALSE, portMAX_DELAY);
        if (bits & ESP_XIAOZHI_CHAT_RECV_SHUTDOWN) {
            break;
        }
        if (!(bits & ESP_XIAOZHI_CHAT_RECV_RECEIVE_ENABLED)) {
            continue;
        }

        /* Receive loop: run while socket is valid and not shutdown; reset error count per session */
        consecutive_errors = 0;
        while (xiaozhi_chat->udp && xiaozhi_chat->udp->udp_socket != -1) {
            if (xEventGroupGetBits(evt) & ESP_XIAOZHI_CHAT_RECV_SHUTDOWN) {
                break;
            }
            int received = recv(xiaozhi_chat->udp->udp_socket, buffer, CONFIG_XIAOZHI_UDP_RECEIVE_BUFFER_SIZE, 0);
            if (received <= 0) {
                EventBits_t current_bits = xEventGroupGetBits(evt);
                if ((current_bits & ESP_XIAOZHI_CHAT_RECV_SHUTDOWN) || !xiaozhi_chat->udp || xiaozhi_chat->udp->udp_socket == -1) {
                    break;
                }
                if (errno == EWOULDBLOCK || errno == EAGAIN) {
                    vTaskDelay(pdMS_TO_TICKS(10));
                    continue;
                }
                if (errno == EBADF || errno == ENOTCONN) {
                    ESP_LOGW(TAG, "Audio input socket closed: %s", strerror(errno));
                    break;
                }

                consecutive_errors++;
                ESP_LOGE(TAG, "Audio input error: %s (error count: %d)", strerror(errno), consecutive_errors);

                if (consecutive_errors >= CONFIG_XIAOZHI_MAX_CONSECUTIVE_UDP_ERRORS) {
                    ESP_LOGE(TAG, "Too many consecutive audio input errors, stopping receive");
                    xiaozhi_chat->error_occurred = true;
                    break;
                }

                vTaskDelay(pdMS_TO_TICKS(100));
                continue;
            }

            consecutive_errors = 0;
            if (received < ESP_XIAOZHI_CHAT_AES_NONCE_SIZE) {
                ESP_LOGE(TAG, "Invalid audio packet size: %d", received);
                continue;
            }

            if (buffer[0] != 0x01) {
                ESP_LOGE(TAG, "Invalid audio packet type: %x", buffer[0]);
                continue;
            }

            uint32_t timestamp = ntohl(*(uint32_t *)&buffer[8]);
            uint32_t sequence = ntohl(*(uint32_t *)&buffer[12]);

            if (sequence < xiaozhi_chat->udp->remote_sequence) {
                ESP_LOGW(TAG, "Received audio packet with old sequence: %lu, expected: %lu", (unsigned long)sequence, (unsigned long)xiaozhi_chat->udp->remote_sequence);
                continue;
            }

            if (sequence != xiaozhi_chat->udp->remote_sequence + 1) {
                ESP_LOGW(TAG, "Received audio packet with wrong sequence: %lu, expected: %lu", (unsigned long)sequence, (unsigned long)(xiaozhi_chat->udp->remote_sequence + 1));
            }

            size_t decrypted_size = received - ESP_XIAOZHI_CHAT_AES_NONCE_SIZE;
            decrypted_data = calloc(1, decrypted_size);
            if (!decrypted_data) {
                ESP_LOGE(TAG, "Failed to allocate memory for decrypted data");
                continue;
            }

            const uint8_t *nonce = (const uint8_t *)buffer;
            const uint8_t *encrypted = (const uint8_t *)buffer + ESP_XIAOZHI_CHAT_AES_NONCE_SIZE;

            uint8_t nonce_counter[ESP_XIAOZHI_CHAT_AES_NONCE_SIZE];
            memcpy(nonce_counter, nonce, sizeof(nonce_counter));
            int ret = esp_xiaozhi_chat_aes_ctr_crypt(&xiaozhi_chat->udp->aes_ctx, decrypted_size, nonce_counter, encrypted, decrypted_data);
            if (ret != 0) {
                ESP_LOGE(TAG, "Failed to decrypt audio data, ret: %d", ret);
                free(decrypted_data);
                decrypted_data = NULL;
                continue;
            }

            esp_xiaozhi_chat_audio_t packet;
            packet.sample_rate = xiaozhi_chat->server_sample_rate;
            packet.frame_duration = xiaozhi_chat->server_frame_duration;
            packet.timestamp = timestamp;
            packet.payload = decrypted_data;
            packet.payload_size = decrypted_size;
            esp_xiaozhi_chat_binary_handler(xiaozhi_chat->mcp_chat_handle, packet.payload, packet.payload_size);

            free(decrypted_data);
            decrypted_data = NULL;
            xiaozhi_chat->udp->remote_sequence = sequence;
            xiaozhi_chat->udp->last_incoming_time = xTaskGetTickCount();
        }

        if (decrypted_data != NULL) {
            free(decrypted_data);
            decrypted_data = NULL;
        }
    }

    free(buffer);
    esp_xiaozhi_chat_audio_input_exit(evt);
}

static esp_err_t esp_xiaozhi_chat_audio_open(esp_xiaozhi_chat_t *xiaozhi_chat)
{
    ESP_RETURN_ON_FALSE(xiaozhi_chat, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    if (!xiaozhi_chat->use_mqtt) {
        xiaozhi_chat->audio_channel_opened = true;
        return ESP_OK;
    }

    if (!xiaozhi_chat->udp) {
        ESP_LOGE(TAG, "UDP context not allocated");
        return ESP_ERR_INVALID_STATE;
    }

    struct addrinfo *res = NULL;
    int sockfd = -1;
    esp_err_t ret = ESP_OK;
    struct addrinfo hints = {
        .ai_family = AF_INET,
        .ai_socktype = SOCK_DGRAM,
    };
    char port_str[16] = {0};

    snprintf(port_str, sizeof(port_str), "%d", xiaozhi_chat->udp->udp_port);
    if (getaddrinfo(xiaozhi_chat->udp->udp_server, port_str, &hints, &res) != 0) {
        ESP_RETURN_ON_ERROR(ESP_ERR_INVALID_ARG, TAG, "Failed to get address info: %s", strerror(errno));
    }

    sockfd = socket(res->ai_family, res->ai_socktype, res->ai_protocol);
    if (sockfd < 0) {
        freeaddrinfo(res);
        ESP_RETURN_ON_ERROR(ESP_ERR_NO_MEM, TAG, "Failed to create socket: %s", strerror(errno));
    }

    if (connect(sockfd, res->ai_addr, res->ai_addrlen) < 0) {
        close(sockfd);
        freeaddrinfo(res);
        ESP_RETURN_ON_ERROR(ESP_ERR_INVALID_ARG, TAG, "Failed to connect audio channel: %s", strerror(errno));
    }

