waveshareteam/ESP32-S3-Touch-AMOLED-1.75/firmware/brookesia/components/esp_xiaozhi_safe/esp_xiaozhi/src/esp_xiaozhi_chat.c
    struct timeval recv_timeout = {
        .tv_sec = ESP_XIAOZHI_CHAT_UDP_RECV_TIMEOUT_MS / 1000,
        .tv_usec = (ESP_XIAOZHI_CHAT_UDP_RECV_TIMEOUT_MS % 1000) * 1000,
    };
    if (setsockopt(sockfd, SOL_SOCKET, SO_RCVTIMEO, &recv_timeout, sizeof(recv_timeout)) < 0) {
        close(sockfd);
        freeaddrinfo(res);
        ESP_RETURN_ON_ERROR(ESP_FAIL, TAG, "Failed to set audio socket recv timeout: %s", strerror(errno));
    }

    struct timeval send_timeout = {
        .tv_sec = ESP_XIAOZHI_CHAT_UDP_SEND_TIMEOUT_MS / 1000,
        .tv_usec = (ESP_XIAOZHI_CHAT_UDP_SEND_TIMEOUT_MS % 1000) * 1000,
    };
    if (setsockopt(sockfd, SOL_SOCKET, SO_SNDTIMEO, &send_timeout, sizeof(send_timeout)) < 0) {
        ESP_LOGW(TAG, "Failed to set audio socket send timeout: %s", strerror(errno));
    }

    if (xSemaphoreTake(xiaozhi_chat->udp->channel_mutex, pdMS_TO_TICKS(1000)) == pdTRUE) {
        xiaozhi_chat->udp->udp_socket = sockfd;
        xiaozhi_chat->audio_channel_opened = true;

        /* Recreate the task after a previous instance exited during deinit. */
        EventBits_t recv_bits = xEventGroupGetBits(xiaozhi_chat->udp->audio_receive_events);
        if (recv_bits & ESP_XIAOZHI_CHAT_RECV_TASK_EXITED) {
            ESP_LOGD(TAG, "Create audio input task (stack=%d)", CONFIG_XIAOZHI_AUDIO_TASK_STACK_SIZE);
            xEventGroupClearBits(xiaozhi_chat->udp->audio_receive_events,
                                 ESP_XIAOZHI_CHAT_RECV_SHUTDOWN | ESP_XIAOZHI_CHAT_RECV_TASK_EXITED);
            esp_err_t task_ret = esp_xiaozhi_chat_create_audio_input_task(xiaozhi_chat);
            if (task_ret != ESP_OK) {
                ESP_LOGE(TAG, "Failed to create audio input task");
                xEventGroupSetBits(xiaozhi_chat->udp->audio_receive_events, ESP_XIAOZHI_CHAT_RECV_TASK_EXITED);
                close(sockfd);
                xiaozhi_chat->udp->udp_socket = -1;
                xiaozhi_chat->audio_channel_opened = false;
                xSemaphoreGive(xiaozhi_chat->udp->channel_mutex);
                freeaddrinfo(res);
                return ESP_ERR_NO_MEM;
            }
        }
        xEventGroupSetBits(xiaozhi_chat->udp->audio_receive_events, ESP_XIAOZHI_CHAT_RECV_RECEIVE_ENABLED);
        xSemaphoreGive(xiaozhi_chat->udp->channel_mutex);
    } else {
        ESP_LOGE(TAG, "Failed to take channel mutex");
        close(sockfd);
        ret = ESP_ERR_TIMEOUT;
    }

    freeaddrinfo(res);
    return ret;
}

static esp_err_t esp_xiaozhi_chat_audio_close(esp_xiaozhi_chat_t *xiaozhi_chat)
{
    if (xiaozhi_chat->udp == NULL) {
        xiaozhi_chat->audio_channel_opened = false;
        return ESP_OK;
    }
    if (xiaozhi_chat->udp->channel_mutex == NULL) {
        xiaozhi_chat->audio_channel_opened = false;
        return ESP_OK;
    }

    bool taken = false;
    for (int retry = 0; retry < ESP_XIAOZHI_CHAT_CLOSE_MUTEX_RETRY_CNT && !taken; retry++) {
        taken = (xSemaphoreTake(xiaozhi_chat->udp->channel_mutex, pdMS_TO_TICKS(ESP_XIAOZHI_CHAT_CLOSE_MUTEX_RETRY_MS)) == pdTRUE);
        if (!taken && retry < ESP_XIAOZHI_CHAT_CLOSE_MUTEX_RETRY_CNT - 1) {
            ESP_LOGW(TAG, "Failed to take mutex for closing UDP socket, retry %d/%d", retry + 1, ESP_XIAOZHI_CHAT_CLOSE_MUTEX_RETRY_CNT);
        }
    }
    if (!taken) {
        ESP_LOGW(TAG, "Failed to take mutex for closing UDP socket after %d retries, force closing", ESP_XIAOZHI_CHAT_CLOSE_MUTEX_RETRY_CNT);
        esp_xiaozhi_chat_udp_force_close_socket(xiaozhi_chat);
        return ESP_OK;
    }

    esp_xiaozhi_chat_udp_force_close_socket(xiaozhi_chat);
    xSemaphoreGive(xiaozhi_chat->udp->channel_mutex);
    return ESP_OK;
}

static esp_err_t esp_xiaozhi_chat_audio_send(esp_xiaozhi_chat_t *xiaozhi_chat, const esp_xiaozhi_chat_audio_t *packet)
{
    esp_err_t result = ESP_FAIL;
    if (esp_xiaozhi_chat_is_audio_ready(xiaozhi_chat)) {
        if (!xiaozhi_chat->use_mqtt) {
            return esp_xiaozhi_transport_send_binary(xiaozhi_chat->mcp_chat_handle, packet->payload, packet->payload_size);
        }

        if (xiaozhi_chat->udp == NULL) {
            ESP_LOGE(TAG, "UDP context not allocated");
            return ESP_ERR_INVALID_STATE;
        }
        if (xSemaphoreTake(xiaozhi_chat->udp->channel_mutex, pdMS_TO_TICKS(100)) != pdTRUE) {
            ESP_RETURN_ON_ERROR(ESP_ERR_TIMEOUT, TAG, "Failed to take mutex");
        }
        if (xiaozhi_chat->udp->udp_socket == -1) {
            xSemaphoreGive(xiaozhi_chat->udp->channel_mutex);
            return ESP_ERR_INVALID_STATE;
        }
        if (packet->payload_size > CONFIG_XIAOZHI_UDP_MAX_AUDIO_PAYLOAD_SIZE) {
            xSemaphoreGive(xiaozhi_chat->udp->channel_mutex);
            ESP_LOGW(TAG, "UDP audio payload too large: %u > %u", packet->payload_size, CONFIG_XIAOZHI_UDP_MAX_AUDIO_PAYLOAD_SIZE);
            return ESP_ERR_INVALID_SIZE;
        }
        uint8_t nonce[ESP_XIAOZHI_CHAT_AES_NONCE_SIZE];
        memcpy(nonce, xiaozhi_chat->udp->aes_nonce, ESP_XIAOZHI_CHAT_AES_NONCE_SIZE);

        *(uint16_t *)&nonce[2] = htons(packet->payload_size);
        *(uint32_t *)&nonce[8] = htonl(packet->timestamp);
        *(uint32_t *)&nonce[12] = htonl(++xiaozhi_chat->udp->local_sequence);

        size_t encrypted_size = ESP_XIAOZHI_CHAT_AES_NONCE_SIZE + packet->payload_size;
        uint8_t *encrypted = malloc(encrypted_size);
        if (encrypted) {
            memcpy(encrypted, nonce, ESP_XIAOZHI_CHAT_AES_NONCE_SIZE);

            uint8_t nonce_counter[ESP_XIAOZHI_CHAT_AES_NONCE_SIZE];
            memcpy(nonce_counter, nonce, sizeof(nonce_counter));
            int ret = esp_xiaozhi_chat_aes_ctr_crypt(&xiaozhi_chat->udp->aes_ctx, packet->payload_size, nonce_counter, packet->payload, &encrypted[ESP_XIAOZHI_CHAT_AES_NONCE_SIZE]);

            if (ret == 0) {
                ssize_t sent = send(xiaozhi_chat->udp->udp_socket, (const char *)encrypted, encrypted_size, 0);
                if (sent == (ssize_t)encrypted_size) {
                    result = ESP_OK;
                } else {
                    result = ESP_FAIL;
                    if (sent < 0) {
                        ESP_LOGW(TAG, "UDP send failed: errno=%d (%s)", errno, strerror(errno));
                        if (errno == ENOMEM || errno == EAGAIN || errno == EWOULDBLOCK) {
                            vTaskDelay(pdMS_TO_TICKS(ESP_XIAOZHI_CHAT_UDP_BACKPRESSURE_DELAY_MS));
                        }
                    } else {
                        ESP_LOGW(TAG, "UDP send short: sent=%zd, expected=%zu", (size_t)sent, encrypted_size);
                    }
                }
            } else {
                ESP_LOGE(TAG, "Failed to encrypt audio data: %d", ret);
            }

            free(encrypted);
        } else {
            ESP_LOGE(TAG, "Failed to allocate memory for encrypted audio data");
        }
        xSemaphoreGive(xiaozhi_chat->udp->channel_mutex);
    } else {
        ESP_LOGD(TAG, "Audio channel not opened");
    }

    return result;
}

esp_err_t esp_xiaozhi_chat_init(esp_xiaozhi_chat_config_t *config, esp_xiaozhi_chat_handle_t *chat_hd)
{
    ESP_RETURN_ON_FALSE(config, ESP_ERR_INVALID_ARG, TAG, "Invalid configuration");
    ESP_RETURN_ON_FALSE(chat_hd, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

