waveshareteam/ESP32-S3-Touch-AMOLED-1.75/firmware/brookesia/components/esp_xiaozhi_safe/esp_xiaozhi/src/esp_xiaozhi_chat.c
    *chat_hd = 0;

    esp_xiaozhi_chat_t *xiaozhi_chat = calloc(1, sizeof(esp_xiaozhi_chat_t));
    ESP_RETURN_ON_FALSE(xiaozhi_chat, ESP_ERR_NO_MEM, TAG, "Failed to allocate memory");

    esp_err_t ret = ESP_OK;

    xiaozhi_chat->use_mqtt = config->has_mqtt_config;

    xiaozhi_chat->event_group_handle = xEventGroupCreate();
    if (xiaozhi_chat->event_group_handle == NULL) {
        ESP_LOGE(TAG, "Failed to create event group");
        ret = ESP_ERR_NO_MEM;
        goto error;
    }

    if (xiaozhi_chat->use_mqtt) {
        xiaozhi_chat->udp = calloc(1, sizeof(esp_xiaozhi_chat_udp_ctx_t));
        if (xiaozhi_chat->udp == NULL) {
            ESP_LOGE(TAG, "Failed to allocate UDP context");
            ret = ESP_ERR_NO_MEM;
            goto error;
        }

        xiaozhi_chat->udp->udp_socket = -1;
        esp_xiaozhi_chat_aes_ctr_init(&xiaozhi_chat->udp->aes_ctx);

        xiaozhi_chat->udp->channel_mutex = xSemaphoreCreateMutex();
        if (xiaozhi_chat->udp->channel_mutex == NULL) {
            ESP_LOGE(TAG, "Failed to create mutex");
            ret = ESP_ERR_NO_MEM;
            goto error;
        }
        xiaozhi_chat->udp->audio_receive_events = xEventGroupCreate();
        if (xiaozhi_chat->udp->audio_receive_events == NULL) {
            ESP_LOGE(TAG, "Failed to create receive event group");
            ret = ESP_ERR_NO_MEM;
            goto error;
        }
        xEventGroupSetBits(xiaozhi_chat->udp->audio_receive_events, ESP_XIAOZHI_CHAT_RECV_TASK_EXITED);
    }

    xiaozhi_chat->audio_type = config->audio_type;
    xiaozhi_chat->audio_callback = config->audio_callback;
    xiaozhi_chat->event_callback = config->event_callback;
    xiaozhi_chat->audio_callback_ctx = config->audio_callback_ctx;
    xiaozhi_chat->event_callback_ctx = config->event_callback_ctx;
    xiaozhi_chat->mcp_engine = config->mcp_engine;
    xiaozhi_chat->owns_mcp_engine = config->owns_mcp_engine;

    ret = esp_xiaozhi_chat_register_instance(xiaozhi_chat);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Only one chat instance is supported");
        goto error;
    }

    *chat_hd = (esp_xiaozhi_chat_handle_t)xiaozhi_chat;

    esp_xiaozhi_chat_set_device_state(xiaozhi_chat, ESP_XIAOZHI_CHAT_DEVICE_STATE_IDLE);
    esp_xiaozhi_chat_set_listening_mode(xiaozhi_chat, ESP_XIAOZHI_CHAT_LISTENING_MODE_AUTO);

    return ESP_OK;

error:
    /* Ownership of caller-provided MCP resources transfers only after init succeeds. */
    esp_xiaozhi_chat_unregister_instance(xiaozhi_chat);
    esp_xiaozhi_chat_release_internal_resources(xiaozhi_chat);
    free(xiaozhi_chat);
    return ret;
}

esp_err_t esp_xiaozhi_chat_deinit(esp_xiaozhi_chat_handle_t chat_hd)
{
    ESP_RETURN_ON_FALSE(chat_hd, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    esp_xiaozhi_chat_t *xiaozhi_chat = (esp_xiaozhi_chat_t *)chat_hd;
    esp_err_t ret = ESP_OK;

    if (xiaozhi_chat->udp != NULL && xiaozhi_chat->udp->audio_receive_events != NULL) {
        xEventGroupSetBits(xiaozhi_chat->udp->audio_receive_events, ESP_XIAOZHI_CHAT_RECV_SHUTDOWN);
        esp_xiaozhi_chat_udp_force_close_socket(xiaozhi_chat);
        EventBits_t bits = xEventGroupWaitBits(xiaozhi_chat->udp->audio_receive_events,
                                               ESP_XIAOZHI_CHAT_RECV_TASK_EXITED,
                                               pdFALSE, pdFALSE, pdMS_TO_TICKS(ESP_XIAOZHI_CHAT_TASK_EXIT_WAIT_MS));
        if (!(bits & ESP_XIAOZHI_CHAT_RECV_TASK_EXITED)) {
            ESP_LOGE(TAG, "Timed out waiting for audio input task to exit; resources retained for deinit retry");
            return ESP_ERR_TIMEOUT;
        }
    }

    ret = esp_xiaozhi_chat_stop_runtime(xiaozhi_chat);
    if (xiaozhi_chat->mcp_mgr_handle != 0) {
        ESP_LOGE(TAG, "MCP manager teardown incomplete; resources retained for deinit retry");
        return (ret != ESP_OK) ? ret : ESP_FAIL;
    }
    if (ret != ESP_OK) {
        /* The manager is gone, so close/stop errors no longer block safe teardown. */
        ESP_LOGW(TAG, "Ignoring non-fatal runtime stop error after MCP manager teardown: %s", esp_err_to_name(ret));
    }

    esp_err_t destroy_ret = esp_xiaozhi_chat_destroy_owned_resources(xiaozhi_chat);
    if (destroy_ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to destroy owned MCP engine; resources retained for deinit retry: %s",
                 esp_err_to_name(destroy_ret));
        return destroy_ret;
    }

    esp_xiaozhi_chat_release_internal_resources(xiaozhi_chat);
    esp_xiaozhi_chat_unregister_instance(xiaozhi_chat);
    free(xiaozhi_chat);

    return ESP_OK;
}

esp_err_t esp_xiaozhi_chat_start(esp_xiaozhi_chat_handle_t chat_hd)
{
    ESP_RETURN_ON_FALSE(chat_hd, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    esp_xiaozhi_chat_t *xiaozhi_chat = (esp_xiaozhi_chat_t *)chat_hd;
    ESP_RETURN_ON_FALSE(xiaozhi_chat->mcp_engine, ESP_ERR_INVALID_ARG, TAG, "MCP engine not initialized");

    esp_err_t ret = ESP_OK;
    esp_xiaozhi_mcp_config_t mcp_config = {
        .session_id = xiaozhi_chat->session_id,
        .session_id_len = strlen(xiaozhi_chat->session_id),
        .use_mqtt = xiaozhi_chat->use_mqtt,
        .callbacks = {
            .on_message_callback = esp_xiaozhi_chat_data_handler,
            .on_binary_callback = esp_xiaozhi_chat_binary_handler,
            .on_connected_callback = esp_xiaozhi_chat_connected_handler,
            .on_disconnected_callback = esp_xiaozhi_chat_disconnected_handler,
            .on_error_callback = esp_xiaozhi_chat_transport_error_handler,
        },
        .ctx = xiaozhi_chat,
    };

    esp_mcp_mgr_config_t mcp_mgr_config = {
        .transport = esp_mcp_transport_xiaozhi,
        .config = &mcp_config,
        .instance = xiaozhi_chat->mcp_engine,
    };

    ret = esp_mcp_mgr_init(mcp_mgr_config, &xiaozhi_chat->mcp_mgr_handle);
    ESP_GOTO_ON_ERROR(ret, error, TAG, "Failed to initialize MCP manager: %s", esp_err_to_name(ret));

    ret = esp_mcp_mgr_start(xiaozhi_chat->mcp_mgr_handle);
    ESP_GOTO_ON_ERROR(ret, error, TAG, "Failed to start MCP manager: %s", esp_err_to_name(ret));

    ret = esp_mcp_mgr_register_endpoint(xiaozhi_chat->mcp_mgr_handle, "mcp_server", NULL);
    ESP_GOTO_ON_ERROR(ret, error, TAG, "Failed to register MCP endpoint: %s", esp_err_to_name(ret));

    ret = esp_xiaozhi_mcp_get_handle(xiaozhi_chat->mcp_mgr_handle, &xiaozhi_chat->mcp_chat_handle);
    ESP_GOTO_ON_ERROR(ret, error, TAG, "Failed to get transport handle from MCP: %s", esp_err_to_name(ret));

    ESP_LOGD(TAG, "MCP manager initialized with %s transport", xiaozhi_chat->use_mqtt ? "MQTT" : "WebSocket");

    return ESP_OK;

error:
    if (xiaozhi_chat->mcp_mgr_handle != 0) {
        esp_err_t cleanup_ret = esp_mcp_mgr_stop(xiaozhi_chat->mcp_mgr_handle);
        if (cleanup_ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to stop MCP manager after start error: %s", esp_err_to_name(cleanup_ret));
        }

        cleanup_ret = esp_mcp_mgr_deinit(xiaozhi_chat->mcp_mgr_handle);
        if (cleanup_ret == ESP_OK) {
            xiaozhi_chat->mcp_mgr_handle = 0;
            xiaozhi_chat->mcp_chat_handle = 0;
        } else {
            /* Preserve the manager handle so chat_deinit() can retry cleanup. */
            ESP_LOGE(TAG, "Failed to deinit MCP manager after start error: %s", esp_err_to_name(cleanup_ret));
        }
    }

    return ret;
}

esp_err_t esp_xiaozhi_chat_stop(esp_xiaozhi_chat_handle_t chat_hd)
{
    ESP_RETURN_ON_FALSE(chat_hd, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    esp_xiaozhi_chat_t *xiaozhi_chat = (esp_xiaozhi_chat_t *)chat_hd;

    esp_err_t ret = esp_xiaozhi_chat_stop_runtime(xiaozhi_chat);
    return ret;
}

esp_err_t esp_xiaozhi_chat_open_audio_channel(esp_xiaozhi_chat_handle_t chat_hd, const esp_xiaozhi_chat_audio_t *audio,
                                              char *message, size_t message_len)
{
    ESP_RETURN_ON_FALSE(chat_hd, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    esp_err_t ret = ESP_OK;
    esp_xiaozhi_chat_t *xiaozhi_chat = (esp_xiaozhi_chat_t *)chat_hd;
    bool message_allocated = false;

    if (message && !message_len) {
        ESP_LOGE(TAG, "Invalid args: message buffer provided but message_len is 0");
        return ESP_ERR_INVALID_ARG;
    }

    ESP_RETURN_ON_ERROR(esp_xiaozhi_chat_validate_audio_params(audio), TAG, "Invalid audio parameters");

    if (!message || !message_len) {
        uint16_t alloc_size = (message_len > 0) ? message_len : CONFIG_XIAOZHI_HELLO_MESSAGE_SIZE;
        if (alloc_size > CONFIG_XIAOZHI_HELLO_MESSAGE_SIZE) {
            alloc_size = CONFIG_XIAOZHI_HELLO_MESSAGE_SIZE;
        }
        message = calloc(1, alloc_size);
        ESP_RETURN_ON_FALSE(message, ESP_ERR_NO_MEM, TAG, "Failed to allocate memory");
        message_allocated = true;
        ret = esp_xiaozhi_chat_get_hello_message(xiaozhi_chat, audio, message, alloc_size);
        if (ret != ESP_OK) {
            free(message);
            ESP_RETURN_ON_ERROR(ret, TAG, "Failed to get hello message");
        }
    }

    xiaozhi_chat->error_occurred = false;
    memset(xiaozhi_chat->session_id, 0, sizeof(xiaozhi_chat->session_id));
    xEventGroupClearBits(xiaozhi_chat->event_group_handle, ESP_XIAOZHI_CHAT_SERVER_HELLO);

