waveshareteam/ESP32-S3-Touch-AMOLED-1.75/firmware/brookesia/components/esp_xiaozhi_safe/esp_xiaozhi/src/esp_xiaozhi_chat.c
    ret = esp_xiaozhi_transport_send_text(xiaozhi_chat->mcp_chat_handle, message);
    if (message_allocated) {
        free(message);
    }
    ESP_RETURN_ON_ERROR(ret, TAG, "Failed to send hello message");

    EventBits_t bits = xEventGroupWaitBits(xiaozhi_chat->event_group_handle, ESP_XIAOZHI_CHAT_SERVER_HELLO, pdTRUE, pdFALSE, pdMS_TO_TICKS(10000));
    if (!(bits & ESP_XIAOZHI_CHAT_SERVER_HELLO)) {
        ESP_RETURN_ON_ERROR(ESP_ERR_INVALID_ARG, TAG, "Failed to receive server hello");
    }

    ret = esp_xiaozhi_chat_audio_open(xiaozhi_chat);
    ESP_RETURN_ON_ERROR(ret, TAG, "Failed to open audio %s", esp_err_to_name(ret));

    esp_event_post(ESP_XIAOZHI_CHAT_EVENTS, ESP_XIAOZHI_CHAT_EVENT_AUDIO_CHANNEL_OPENED, NULL, 0,
                   ESP_XIAOZHI_EVENT_POST_TIMEOUT);

    return ESP_OK;
}

esp_err_t esp_xiaozhi_chat_close_audio_channel(esp_xiaozhi_chat_handle_t chat_hd)
{
    ESP_RETURN_ON_FALSE(chat_hd, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    esp_xiaozhi_chat_t *xiaozhi_chat = (esp_xiaozhi_chat_t *)chat_hd;
    if (strlen(xiaozhi_chat->session_id) > 0) {
        cJSON *root = cJSON_CreateObject();
        if (root) {
            cJSON_AddStringToObject(root, "session_id", xiaozhi_chat->session_id);
            cJSON_AddStringToObject(root, "type", "goodbye");

            esp_xiaozhi_chat_send_json_message(xiaozhi_chat, root);
            cJSON_Delete(root);
        } else {
            ESP_LOGW(TAG, "Failed to create goodbye JSON, skip notifying server (channel will still close)");
        }
    }

    memset(xiaozhi_chat->session_id, 0, sizeof(xiaozhi_chat->session_id));
    esp_xiaozhi_chat_audio_close(xiaozhi_chat);

    esp_event_post(ESP_XIAOZHI_CHAT_EVENTS, ESP_XIAOZHI_CHAT_EVENT_AUDIO_CHANNEL_CLOSED, NULL, 0,
                   ESP_XIAOZHI_EVENT_POST_TIMEOUT);

    return ESP_OK;
}

esp_err_t esp_xiaozhi_chat_send_audio_data(esp_xiaozhi_chat_handle_t chat_hd, const char *data, size_t data_len)
{
    ESP_RETURN_ON_FALSE(chat_hd, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");
    ESP_RETURN_ON_FALSE(data, ESP_ERR_INVALID_ARG, TAG, "Invalid data");
    ESP_RETURN_ON_FALSE(data_len > 0, ESP_ERR_INVALID_ARG, TAG, "Invalid data length");

    esp_xiaozhi_chat_t *xiaozhi_chat = (esp_xiaozhi_chat_t *)chat_hd;
    esp_xiaozhi_chat_audio_t packet = {
        .sample_rate = xiaozhi_chat->server_sample_rate,
        .frame_duration = xiaozhi_chat->server_frame_duration,
        .timestamp = xTaskGetTickCount(),
        .payload = (uint8_t *)data,
        .payload_size = data_len,
    };

    return esp_xiaozhi_chat_audio_send(xiaozhi_chat, &packet);
}

esp_err_t esp_xiaozhi_chat_send_wake_word(esp_xiaozhi_chat_handle_t chat_hd, const char *wake_word)
{
    ESP_RETURN_ON_FALSE(chat_hd, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");
    ESP_RETURN_ON_FALSE(wake_word && strlen(wake_word) > 0, ESP_ERR_INVALID_ARG, TAG, "Invalid wake word");

    esp_xiaozhi_chat_t *xiaozhi_chat = (esp_xiaozhi_chat_t *)chat_hd;
    cJSON *root = NULL;
    esp_err_t ret = esp_xiaozhi_chat_create_session_message(xiaozhi_chat, "listen", &root);
    ESP_RETURN_ON_ERROR(ret, TAG, "Failed to create session message");

    cJSON_AddStringToObject(root, "state", "detect");
    cJSON_AddStringToObject(root, "text", wake_word);

    ret = esp_xiaozhi_chat_send_json_message(xiaozhi_chat, root);
    cJSON_Delete(root);
    return ret;
}

esp_err_t esp_xiaozhi_chat_send_start_listening(esp_xiaozhi_chat_handle_t chat_hd, int mode)
{
    ESP_RETURN_ON_FALSE(chat_hd, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    esp_xiaozhi_chat_t *xiaozhi_chat = (esp_xiaozhi_chat_t *)chat_hd;
    const char *mode_str = (mode == ESP_XIAOZHI_CHAT_LISTENING_MODE_REALTIME) ? "realtime" :
                           (mode == ESP_XIAOZHI_CHAT_LISTENING_MODE_AUTO) ? "auto" :
                           (mode == ESP_XIAOZHI_CHAT_LISTENING_MODE_MANUAL) ? "manual" : "unknown";

    cJSON *root = NULL;
    esp_err_t ret = esp_xiaozhi_chat_create_session_message(xiaozhi_chat, "listen", &root);
    ESP_RETURN_ON_ERROR(ret, TAG, "Failed to create session message");

    cJSON_AddStringToObject(root, "state", "start");
    cJSON_AddStringToObject(root, "mode", mode_str);

    ret = esp_xiaozhi_chat_send_json_message(xiaozhi_chat, root);
    cJSON_Delete(root);
    return ret;
}

esp_err_t esp_xiaozhi_chat_send_stop_listening(esp_xiaozhi_chat_handle_t chat_hd)
{
    ESP_RETURN_ON_FALSE(chat_hd, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    esp_xiaozhi_chat_t *xiaozhi_chat = (esp_xiaozhi_chat_t *)chat_hd;
    cJSON *root = NULL;
    esp_err_t ret = esp_xiaozhi_chat_create_session_message(xiaozhi_chat, "listen", &root);
    ESP_RETURN_ON_ERROR(ret, TAG, "Failed to create session message");

    cJSON_AddStringToObject(root, "state", "stop");

    ret = esp_xiaozhi_chat_send_json_message(xiaozhi_chat, root);
    cJSON_Delete(root);
    return ret;
}

esp_err_t esp_xiaozhi_chat_send_abort_speaking(esp_xiaozhi_chat_handle_t chat_hd, esp_xiaozhi_chat_abort_speaking_reason_t reason)
{
    ESP_RETURN_ON_FALSE(chat_hd, ESP_ERR_INVALID_ARG, TAG, "Invalid handle");

    esp_xiaozhi_chat_t *xiaozhi_chat = (esp_xiaozhi_chat_t *)chat_hd;
    const char *reason_str = (reason == ESP_XIAOZHI_CHAT_ABORT_SPEAKING_REASON_WAKE_WORD_DETECTED) ? "wake_word_detected" : (reason == ESP_XIAOZHI_CHAT_ABORT_SPEAKING_REASON_STOP_LISTENING) ? "stop_listening" : "unknown";

    cJSON *root = NULL;
    esp_err_t ret = esp_xiaozhi_chat_create_session_message(xiaozhi_chat, "abort", &root);
    ESP_RETURN_ON_ERROR(ret, TAG, "Failed to create session message");

    cJSON_AddStringToObject(root, "reason", reason_str);

    ret = esp_xiaozhi_chat_send_json_message(xiaozhi_chat, root);
    cJSON_Delete(root);
    return ret;
}
